Тестовая_база_ERP_14/src/InformationRegisters/ПорядокОтраженияПодарочныхСертификатов/ПорядокОтраженияПодарочныхСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокОтраженияПодарочныхСертификатов</name>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСертификата</name>
    <type>
      <types>CatalogRef.ВидыПодарочныхСертификатов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/СчетаРеглУчетаТребующиеНастройки/СчетаРеглУчетаТребующиеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаРеглУчетаТребующиеНастройки</name>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>CatalogRef.КатегорииЭксплуатации</types>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
      <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
      <types>CatalogRef.Кассы</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      <types>CatalogRef.ВидыПодарочныхСертификатов</types>
      <types>CatalogRef.Резервы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоУчета</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидыСчетовРеглУчета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/ВидыСчетовРеглУчета/ВидыСчетовРеглУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСчетовРеглУчета</name>
  <enumValues>
    <name>АвансыВыданные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродаж</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
  </enumValues>
  <enumValues>
    <name>НаСкладе</name>
  </enumValues>
  <enumValues>
    <name>НДСпоПриобретеннымЦенностям</name>
  </enumValues>
  <enumValues>
    <name>НДСПриДоходах</name>
  </enumValues>
  <enumValues>
    <name>НДСПриЗакупке</name>
  </enumValues>
  <enumValues>
    <name>НДСПриОтгрузкеБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>НДСПриПродаже</name>
  </enumValues>
  <enumValues>
    <name>НДСПриПродажеКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>РеализацияБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперации</name>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
  </enumValues>
  <enumValues>
    <name>РасходыМЦ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРасчетыПоВознаграждению</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоПодарочнымСертификатам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоПретензиям</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентами</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентамиТара</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщикамиТара</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродажКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>ТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ТМЦВЭксплуатацииЗаБалансом</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовОСНО</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеАктивыПассивы</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовЕНВД</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияВНА</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияВНА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>ВыбытиеВНА</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьВНА</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьВНА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>РезервДоОценкиВНА</name>
  </enumValues>
  <enumValues>
    <name>ЗабалансовыйУчетВНА</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиКомиссия</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиПроценты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиКомиссия</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиПроценты</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажЕНВД</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродажЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ЗатратыНаПриобретениеТМЦ</name>
  </enumValues>
  <enumValues>
    <name>НеотфактурованныеПоставки</name>
  </enumValues>
  <enumValues>
    <name>Резервы</name>
  </enumValues>
  <enumValues>
    <name>ЛизинговыеУслуги</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатежПоЛизингу</name>
  </enumValues>
  <enumValues>
    <name>ВыкупПредметаЛизинга</name>
  </enumValues>
  <enumValues>
    <name>АрендныеОбязательстваПоЛизингу</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Catalogs/ВидыПодарочныхСертификатов/ВидыПодарочныхСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыПодарочныхСертификатов</name>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>EnumRef.ТипыКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичнаяОплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходов</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШаблоныКодовПодарочныхСертификатов</name>
    <attributes>
      <name>ДлинаШтрихкода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДиапазонаШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецДиапазонаШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаМагнитногоКода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДиапазонаМагнитногоКода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецДиапазонаМагнитногоКода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонМагнитнойКарты</name>
      <type>
        <types>CatalogRef.ШаблоныМагнитныхКарт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/InformationRegisters/ПорядокОтраженияПодарочныхСертификатов/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Отказ ИЛИ ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокОтраженияПодарочныхСертификатов.Организация,
	|	ПорядокОтраженияПодарочныхСертификатов.ВидСертификата,
	|	ПорядокОтраженияПодарочныхСертификатов.ВидСертификата = ЗНАЧЕНИЕ(Справочник.ВидыПодарочныхСертификатов.ПустаяСсылка)
	|		И ПорядокОтраженияПодарочныхСертификатов.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ЭтоОбщаяНастройка,
	|	ПорядокОтраженияПодарочныхСертификатов.СчетУчета
	|ПОМЕСТИТЬ ТаблицаНовыхДанных
	|ИЗ
	|	&ТаблицаНовыхДанных КАК ПорядокОтраженияПодарочныхСертификатов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНовыхДанных.Организация,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчета,
	|	ТаблицаНовыхДанных.ВидСертификата КАК АналитикаУчета,
	|	ТаблицаНовыхДанных.ЭтоОбщаяНастройка КАК ЭтоОбщаяНастройка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыПоПодарочнымСертификатам) КАК ВидСчета
	|ПОМЕСТИТЬ ДанныеЗаполненныхСчетовРегистра
	|ИЗ
	|	ТаблицаНовыхДанных КАК ТаблицаНовыхДанных
	|ГДЕ
	|	ТаблицаНовыхДанных.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ТаблицаНовыхДанных", ЭтотОбъект.Выгрузить());
	Запрос.Выполнить();
	РегистрыСведений.СчетаРеглУчетаТребующиеНастройки.ОчиститьПриЗаписиРегистра(Запрос.МенеджерВременныхТаблиц);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
